posts/reading/go-in-action/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Go In Action | Warren Liu</title>
<link href="../../../assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/poole.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/lanyon.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/custom.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://wudong.graceliu.uk/posts/reading/go-in-action/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../introducing-go/" title="Introducing Go" type="text/html">
<link rel="next" href="../functional-programming-in-scala/" title="Functional Programming in Scala" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Go In Action">
<meta property="og:url" content="https://wudong.graceliu.uk/posts/reading/go-in-action/">
<meta property="og:description" content="Table of Contents


Introducing Go
Go quick-start
Package and tooling
Arrays, slices, and maps






Introducing Go


Goroutines are functions that run concurrently with other
goroutines, including th">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-15T00:00:00+01:00">
<meta property="article:tag" content="go">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../../archive.html">Archive</a>
        <a class="sidebar-nav-item" href="../../../categories/">Tags</a>
        <a class="sidebar-nav-item" href="../../../rss.xml">RSS feed</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://wudong.graceliu.uk/" title="Warren Liu" rel="home">Warren Liu</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">Go In Action</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">Warren Liu</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2017-07-15T00:00:00+01:00" itemprop="datePublished" title="2017-07-15 00:00">2017-07-15 00:00</time></a></p>
        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introducing Go</a></li>
<li><a href="#sec-2">Go quick-start</a></li>
<li><a href="#sec-3">Package and tooling</a></li>
<li><a href="#sec-4">Arrays, slices, and maps</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introducing Go</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>
<b>Goroutines</b> are functions that run concurrently with other
goroutines, including the entry point of your program. In other
languages, you 'd use threads to accomplish the same thing, but in
Go, <span class="underline">many goroutines execute on <b>single thread</b></span>.
</li>
<li>In Go, the net/http library has concurrentcy build in using
goroutings. Each inbound request automatically runs on its own
goroute.
</li>
<li>Goroutines use less memory that threads and Go runtime will
automatically schedule the execution of goroutines against a set of
configured logical processors. <span class="underline">Each <b>logical processor</b> is bound to a
single OS thread</span>.
</li>
<li>
<b>Channels</b> are data structures that enable safe data communication
between goroutines.
</li>
<li>
<b>Channels</b> help to enforce the pattern that only one goroutine
should modify the data at any time.
</li>
<li>It is imortant tonote that channels don't provide data access
protection between goroutines. If copies of data are exchanged
through a channel, each goroutine has its own copy and can make any
changes to that data safely. When pointers to the data are being
exchanged, each goroutine still need to be synchronized if reads and
writes will be performed by different goroutines.
</li>
<li>Go developers embed types to reuse functionality in a design pattern
called <b>composition</b>. Other languages use composition, but it is
often deeply tired to inheritance, which make it complicated and
difficult to use.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Go quick-start</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>If you <code>main</code> function doesn't exist in package <code>main</code>, the build
tools won't produce an executable.
</li>
<li>All code files in a folder must use the same package name, and it is
common practise to name the package after the folder. A <span class="underline">package
defines a unit of compiled code</span>, and each unit of code represents a package.
</li>
<li>The Go compiler won't let you declare a package to be imported if it
is not used. The <b>blank identifier</b> allow the compiler to accept the
import and call any <code>init</code> functions that can be found in the
different code files within that package.
</li>
<li>All <code>init</code> functions in any code file that are part of the program
will get called before the <code>main</code> function.
</li>
<li>By default the logger is set to write to stderr device, however this
can be changed with:
<div class="highlight"><pre><span></span>log.SetOutput(os.Stdout)
</pre></div>
</li>
<li>The compiler will always look for the packages you import at the
locations referenced by the <code>GOROOT</code> and <code>GOPATH</code> environment
variables.
</li>
<li>Variables located outside the scope of any function are considered
package-level variable.
</li>
<li>Identifiers start with a captial letter are exported, while
identifiers start with a lowercase letter are unexported.
</li>
<li>In Go, all variables are initialized to their zero value. For
pointers, the zero value is <code>nil</code>. For reference types, their
underlying data structures are initialized to their zero values.
</li>
<li>The short variable declaration operator <code>:=</code> is used to both declare
and initialize variables at the same time. The type of each value
being returned is used by the compiler to determine the type of each
variable, respectively.
</li>
<li>A good rule of thumb when declaring variables is to use keyword
<code>var</code> when declaring variables that will be initialized to their
zero value, and to use the short variable declaration operator when
providing extra initialization or making a function call.
</li>
<li>In Go, once the <code>main</code> function returns, the program terminates. Any
goroutines that are still running at this time will also be
terminated by the Go runtime.
</li>
<li>
<code>WaitGroup</code> from the <code>sync</code> package is a great way to track when a
goroutine is finished performing its work. A <code>WaitGroup</code> is a
counting semaphore.
</li>
<li>The keyword <code>range</code> can be used with arrays, strings, slices, maps
and channels.
</li>
<li>When use <code>for range</code> to iterate over a slice, we get two values back
on each iteration, the first is the index position, and the second
is a <b>copy</b> of the value in that element.
</li>
<li>When you have function that returns multiple values, and you don't
have a need for one, the blank identifier can be used to ignore
those values:
<div class="highlight"><pre><span></span>for _, feed := range feeds {}
</pre></div>
</li>
<li>When a key doesn't exist, the map will return the zero value for the
type of value being stored in the map. When the key does exist, the
map will return a <b>copy</b> of the value for that key.
</li>
<li>Go supports closures. The <code>anonymous</code> function isn't given a copy of
these variables; it has direct access to the same variables declared
in the scope of outer functon.
</li>
<li>Tag can be used to add meta data for struct fields:
<div class="highlight"><pre><span></span>type Feed struct {
	Name string `json: "site"`
	URI string `json: "link"`
	Type string `json: "type"`
}
</pre></div>
<p>
The above example use tag to map a struct with a JSON document.
</p>
</li>
<li>The keyword <code>defer</code> lets us write statement close to where the
open occurs, which helps with readability and reducing bugs.
</li>
<li>Empty interface:
<div class="highlight"><pre><span></span>func (dec *Decoder) Decode (v interface{}) error
</pre></div>
<p>
This is a special type in Go, which allow <code>Decode</code> method to accept
any type of value.
</p>
</li>
<li>A name conventionin Go for interfaces: if the interface type
contains only one method, the name of the interface ends with the
<code>er</code> suffix.
</li>
<li>The use of a receiver with any function declaration declares a
method that is bound to the specified reciever type.
</li>
<li>Whether we use a value or pointer of the receiver type to make the
method call, the compiler will reference or deference the value if
necessary to support the call.
</li>
<li>It is best practice to declare methods using pointer receivers,
since many of the methods you implements need to manipulate the
state of the value being used to make the method call.
</li>
<li>Interface type bcan be assigned to either value or pointer:
<div class="highlight"><pre><span></span>var dm defaultMatcher
//Assign value to interface type Matcher
var matcher1 Matcher = dm
//Can also assign the interface type to a pointer
var matcher2 Matcher = &amp;dm
</pre></div>
</li>
<li>Methods declared with pointer receivers can only be called by
interface type values that contain pointers. Methods declared with
value receivers can be called by interface type that contain both
values and points.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Package and tooling</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Go programs are organized into groups of files called packages, so
that <b>code</b> has the abitity to be included into other projects as
<span class="underline">smaller resuable pieces</span>.
</li>
<li>You cannot have multiple packages in the same directory, nor split a
package across multiple directories.
</li>
<li>Unique package name is not required, because package is imported
using its full path. The package name is used as the default name
when it is imported, but it can be overridden:
<div class="highlight"><pre><span></span>import (
	"fmt"
	myfmt "mylib/fmt"
)
</pre></div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Arrays, slices, and maps</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>When an array is initialized, each individual element that belongs
to the array is initialized to its zero value.
</li>
<li>Array literal:
<div class="highlight"><pre><span></span>array := [5]int {1,2,3,4,5}
</pre></div>
</li>
<li>Declaring an array with Go calculating size:
<div class="highlight"><pre><span></span>array := [...]int{1,2,3,4,5}
</pre></div>
</li>
<li>Declaring an array initializing specific elements:
<div class="highlight"><pre><span></span>array := [5]int{1: 1, 2: 2}
</pre></div>
</li>
<li>An array is a value in Gl. This means you can use it in an
assignment operation. The variable name denotes the entire array,
and can be assigned to other arrays of the same type:
<div class="highlight"><pre><span></span>var array1 [5]string
array2 :=[5]string{"a", "b", "c", "d", "e"}
//copy the values from array2 into array1.
array1=array2
//after the copy the two array is identical.
</pre></div>
</li>
<li>The type of an array variable includes both the length and the type
of data. Only arrays of the same type can be assigned.
</li>
<li>Arrays are <b>always</b> one-dimensional, but they can be composed to
create multidimensinal arrays.
</li>
<li>Passing an array between functions can be expensive because array is
a value and the whole array will be copied.
</li>
<li>An idiomatic way of creating a slice is to use a slice
literal. Similar to creating an array, excpet don't specify a value
inside of the [] operator. Remember: <span class="underline">If a value is specified inside
the [] operator, an array is created, otherwise, a slice is created</span>.
</li>
<li>A <code>nil</code> slice represent a slice that doesn't exist:
<div class="highlight"><pre><span></span>//create a nil slice of integres.
var slice []int
</pre></div>
</li>
<li>An empty slice is different from <code>nil</code> slice in that its array
pointer is an empty array, instead of a <code>nil</code>. It is used to
represents an empty collection.
</li>
<li>Taking the slice of a slice:
<div class="highlight"><pre><span></span>slice := []int{1,2,3,4,5}
//create a new slice
newSlice := slice[1:3]
</pre></div>
</li>
<li>A slice can only access indexes up to its length. Accessing outside
its length will cause a runtime exception.
</li>
<li>By set the capacity of a new slice to be the same as the length, you
can force the first append operation to detach the new slice from
the underlying array, which make it safe to change.
</li>
<li>The <code>append</code> is a variadic function. This means you can pass
multiple values to be appended. If you use the <code>...</code> operator, you
can append all the elements of one slice into another:
<div class="highlight"><pre><span></span>s1 := []int{1,2}
s2 := []int{3,4}
//s3 : [1,2,3,4]
s3 := append(s1, s2...)
</pre></div>
</li>
<li>It is important to know that <code>range</code> is making a copy of the value,
not a reference.
</li>
<li>Passing a slice between two functions requires nothing more than
passing the slice by value.
</li>
<li>Maps are collections and can be iterated. But maps are unordered
collections. There is no way to predict the order in which the
key/value pairs will be returned. <span class="underline">Every iteration over a map could
return a different order</span>.
</li>
<li>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/go/" rel="tag">go</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../introducing-go/" rel="prev" title="Introducing Go">Previous post</a>
            </li>
            <li class="next">
                <a href="../functional-programming-in-scala/" rel="next" title="Functional Programming in Scala">Next post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2017         <a href="mailto:wudong@graceliu.uk">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../../assets/js/jquery.min.js"></script><script src="../../../assets/js/moment-with-locales.min.js"></script><script src="../../../assets/js/fancydates.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
